Перем ТекстОшибок;
Перем ОбновленоДоговоров;   
Перем ОбновленоСоглашений; 
Перем ВсегоДоговоров ;
Перем ВсегоСоглашений;
Перем ОшибкиПоДоговору;
Перем ОшибкиПоСоглашению; 
Перем ВсегоОбработано;
Перем ТаблицаВсех;
&НаСервере
Процедура ПодобратьНаСервере()  
	
	Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
                   |	Партнеры.Ссылка КАК Ссылка,
                   |	Партнеры.БизнесРегион КАК БизнесРегион,
                   |	Партнеры.ГруппаДоступа КАК ГруппаДоступа,
                   |	Партнеры.ЗонаДоставки КАК ЗонаДоставки
                   |ПОМЕСТИТЬ ВТ_Партнеры
                   |ИЗ
                   |	Справочник.Партнеры КАК Партнеры
                   |ГДЕ
                   |	Партнеры.Ссылка <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
                   |	И Партнеры.Клиент = ИСТИНА
                   |	И Партнеры.Ссылка В ИЕРАРХИИ(&Партнеры)
                   |	И Партнеры.БизнесРегион = &БизнесРегион
                   |	И Партнеры.ГруппаДоступа = &ГруппаДоступа
                   |	И Партнеры.ЗонаДоставки = &ЗонаДоставки
                   |;
                   |
                   |////////////////////////////////////////////////////////////////////////////////
                   |ВЫБРАТЬ
                   |	ДоговорыКонтрагентов.Ссылка КАК Договор,
                   |	ВТ_Партнеры.Ссылка КАК Контрагент,
                   |	&Менеджер КАК Менеджер,
                   |	ВТ_Партнеры.БизнесРегион КАК БизнесРегион,
                   |	ВТ_Партнеры.ГруппаДоступа КАК ГруппаДоступа,
                   |	ВТ_Партнеры.ЗонаДоставки КАК ЗонаДоставки,
                   |	ВТ_Партнеры.Ссылка.Наименование КАК СсылкаНаименование,
				   |	ДоговорыКонтрагентов.ТипДоговора КАК Вид
				   |ИЗ
                   |	ВТ_Партнеры КАК ВТ_Партнеры
                   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
                   |		ПО ВТ_Партнеры.Ссылка = ДоговорыКонтрагентов.Партнер
                   |ГДЕ
                   |	ДоговорыКонтрагентов.ПометкаУдаления = ЛОЖЬ
                   |	И (ДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
                   |			ИЛИ ДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.НеСогласован))
                   |	И ДоговорыКонтрагентов.Менеджер = &Менеджер
                   |	И ДоговорыКонтрагентов.ТипДоговора В(&МассивТиповДоговоров)
                   |
                   |ОБЪЕДИНИТЬ ВСЕ
                   |
                   |ВЫБРАТЬ
                   |	СоглашенияСКлиентами.Ссылка,
                   |	ВТ_Партнеры.Ссылка,
                   |	&Менеджер,
                   |	ВТ_Партнеры.БизнесРегион,
                   |	ВТ_Партнеры.ГруппаДоступа,
                   |	ВТ_Партнеры.ЗонаДоставки,
                   |	ВТ_Партнеры.Ссылка.Наименование,
                   |	СоглашенияСКлиентами.ХозяйственнаяОперация 
                   |ИЗ
                   |	ВТ_Партнеры КАК ВТ_Партнеры
                   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами КАК СоглашенияСКлиентами
                   |		ПО ВТ_Партнеры.Ссылка = СоглашенияСКлиентами.Партнер
                   |ГДЕ
                   |	СоглашенияСКлиентами.ПометкаУдаления = ЛОЖЬ
                   |	И (СоглашенияСКлиентами.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСоглашенийСКлиентами.Действует)
                   |			ИЛИ СоглашенияСКлиентами.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСоглашенийСКлиентами.НеСогласовано))
                   |	И СоглашенияСКлиентами.Менеджер = &Менеджер
                   |	И СоглашенияСКлиентами.ХозяйственнаяОперация В(&МассивХО)
                   |
                   |УПОРЯДОЧИТЬ ПО
                   |	СсылкаНаименование,
                   |	Контрагент
                   |ИТОГИ
                   |	МАКСИМУМ(БизнесРегион),
                   |	МАКСИМУМ(ГруппаДоступа),
                   |	МАКСИМУМ(ЗонаДоставки)
                   |ПО
                   |	Контрагент";
	
	Запрос.УстановитьПараметр("Менеджер", Объект.Агент);
	
	МассивТиповДоговоров = Новый Массив();
	МассивТиповДоговоров.Добавить(Перечисления.ТипыДоговоров.СПокупателем);
	МассивТиповДоговоров.Добавить(Перечисления.ТипыДоговоров.СХранителем);

	Запрос.УстановитьПараметр("МассивТиповДоговоров", МассивТиповДоговоров); 
	
	МассивХО = Новый Массив();
	МассивХО.Добавить(Перечисления.ХозяйственныеОперации.РеализацияКлиенту);
	МассивХО.Добавить(Перечисления.ХозяйственныеОперации.ПередачаНаХранениеСПравомПродажи);

	Запрос.УстановитьПараметр("МассивХО", МассивХО);

	Если Не ЗначениеЗаполнено(Объект.ГруппаДоступа) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И Партнеры.ГруппаДоступа = &ГруппаДоступа", ""); 
	Иначе
		Запрос.УстановитьПараметр("ГруппаДоступа", Объект.ГруппаДоступа);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.ЗонаДоставки) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И Партнеры.ЗонаДоставки = &ЗонаДоставки", "");
	Иначе
		Запрос.УстановитьПараметр("ЗонаДоставки", Объект.ЗонаДоставки);	 
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.БизнесРегион) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И Партнеры.БизнесРегион = &БизнесРегион", ""); 
	Иначе
		Запрос.УстановитьПараметр("БизнесРегион", Объект.БизнесРегион);	 
	КонецЕсли;	 
	Если Не ЗначениеЗаполнено(СписокПартнеров) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И Партнеры.Ссылка В ИЕРАРХИИ(&Партнеры)", ""); 
	Иначе
		Запрос.УстановитьПараметр("Партнеры", СписокПартнеров.ВыгрузитьЗначения());	 
	КонецЕсли;

	Результат = Запрос.Выполнить();  
	Объект.ВсеЗаписиСписком.Загрузить(Результат.Выгрузить());
	ВыборкаКонтрагента = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	
	Объект.Таб.Очистить();
	Пока ВыборкаКонтрагента.Следующий() Цикл  
		
		 НоваяСтрока = Объект.Таб.Добавить();
		 НоваяСтрока.Контрагент = ВыборкаКонтрагента.Контрагент;
		 НоваяСтрока.ГруппаДоступа= ВыборкаКонтрагента.ГруппаДоступа;
		 НоваяСтрока.ЗонаДоставки = ВыборкаКонтрагента.ЗонаДоставки;
		 НоваяСтрока.БизнесРегион = ВыборкаКонтрагента.БизнесРегион;
		 НоваяСтрока.Менеджер = Объект.Агент;
		 НоваяСтрока.Колво = 1;
		 Выборка = ВыборкаКонтрагента.Выбрать();
		 
		 Пока Выборка.Следующий() Цикл
			 Договор = Выборка.Договор; 
			 Если ТипЗнч(Договор) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда  
				 Если Договор.ТипДоговора = Перечисления.ТипыДоговоров.СПокупателем Тогда 
					 НоваяСтрока.ДоговорРеализация = Договор;
					 НоваяСтрока.ОбДР = Истина;
				 Иначе
					 НоваяСтрока.ДоговорПередача = Договор;  
					 НоваяСтрока.ОбДП = Истина;
				 КонецЕсли;
			 Иначе
				 Если Договор.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиенту Тогда 
					 НоваяСтрока.СоглашениеРеализация = Договор; 
					 НоваяСтрока.ОбСР = Истина;
				 Иначе
					 НоваяСтрока.СоглашениеПередача = Договор; 
					 НоваяСтрока.ОбСП = Истина;
				 КонецЕсли;

			 КонецЕсли;	 
		 КонецЦикла;   
		 
	КонецЦикла;
	//Объект.Таб.Загрузить(Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подобрать(Команда)
	ПодобратьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	УстановитьВыбор(Истина, Объект.Таб, Элементы.Таб);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВыбор(Выбор, Таблица, ТаблицаФормы)
	Для Каждого Стр Из Таблица Цикл
		Если ТаблицаФормы.ПроверитьСтроку(Стр.ПолучитьИдентификатор())Тогда
			Стр.Об = Выбор;
		КонецЕсли;
	КонецЦикла;  
	ПересчитатьКолвоКонтрагентов();
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	УстановитьВыбор(Ложь, Объект.Таб, Элементы.Таб);  
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВыделенные(Команда)
	Строки = Элементы.Таб.ВыделенныеСтроки;
	Для Каждого Стр Из Строки Цикл  
		Строка = Элементы.Таб.ДанныеСтроки(Стр);
		Строка.Об = Истина;
	КонецЦикла;   
	ПересчитатьКолвоКонтрагентов();
КонецПроцедуры

&НаСервере
Процедура ПересчитатьКолвоКонтрагентов()
	
	ТаблицаРеализаций = Объект.Таб.Выгрузить();
	ТаблицаРеализаций.Свернуть("Об", "Колво");
	
	НайденнаяСтрока = ТаблицаРеализаций.Найти(Истина,"Об");
	
	Если НайденнаяСтрока <> Неопределено Тогда
		Объект.КоличествоКонтрагентов = НайденнаяСтрока.Колво; 
	Иначе
		Объект.КоличествоКонтрагентов = 0;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьМенеджера(Команда)
	
	ДанныеЗадания = ЗапуститьФоновуюЗамену();
	// Процедура обновления шкалы прогресса
	ОповещениеОПрогрессе = Новый ОписаниеОповещения("ОбновитьПрогрессВыполнения", ЭтаФорма); 
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтаФорма);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ПараметрыОжидания.ОповещениеОПрогрессеВыполнения = ОповещениеОПрогрессе;

	// Выполнится после завершения фонового задания
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОповеститьОЗавершенииЗагрузки", ЭтаФорма);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДанныеЗадания, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПрогрессВыполнения(ДанныеПрогресса, ДополнительныеПараметры) Экспорт
	
	// Здесь обновляем шкалу прогресса
	Если ДанныеПрогресса.Прогресс = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПрогрессВыполнения = ДанныеПрогресса.Прогресс.Процент;  
	Если ЗначениеЗаполнено(ДанныеПрогресса.Прогресс.Текст) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ДанныеПрогресса.Прогресс.Текст);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповеститьОЗавершенииЗагрузки(Задание, ДополнительныеПараметры) Экспорт
	
	// А здесь оповещаем о завершении фонового задания
	Если Задание.Статус = "Выполнено" Тогда 
		
		ПоказатьПредупреждение(, НСтр("ru = 'Замена завершена'"), 20);
		Возврат;
		
	ИначеЕсли Задание.Статус = "Ошибка" Тогда 
		ВызватьИсключение Задание.ПодробноеПредставлениеОшибки;
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Функция ЗапуститьФоновуюЗамену()

	// Параметры для запуска фонового задания
	ПараметрыВыполненияФоновогоЗадания = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполненияФоновогоЗадания.ОжидатьЗавершение = 0;
	ПараметрыВыполненияФоновогоЗадания.ЗапуститьВФоне = Истина;
	
	ИдентификаторКомандыЗагрузкиДокументов = РеквизитФормыВЗначение("Объект").ИдентификаторСерверногоМетодаОбработки();
	
	// см. ДополнительныеОтчетыИОбработки.ВыполнитьКоманду.ПараметрыКоманды
	ПараметрыОбработкиЗагрузки = Новый Структура;
	ПараметрыОбработкиЗагрузки.Вставить("ДополнительнаяОбработкаСсылка", Параметры.ДополнительнаяОбработкаСсылка);
	ПараметрыОбработкиЗагрузки.Вставить("ИдентификаторКоманды", ИдентификаторКомандыЗагрузкиДокументов);
	ПараметрыОбработкиЗагрузки.Вставить("Таблица", Объект.Таб.Выгрузить());
	ПараметрыОбработкиЗагрузки.Вставить("КоличествоОбщее", Объект.КоличествоКонтрагентов);
	ПараметрыОбработкиЗагрузки.Вставить("ВсеЗаписиСписком", Объект.ВсеЗаписиСписком.Выгрузить());
	ПараметрыОбработкиЗагрузки.Вставить("Агент", Объект.Агент);
	ПараметрыОбработкиЗагрузки.Вставить("ПоАгенту", Объект.ПоАгенту);
	
	ИмяФункцииФоновогоЗадания = "ДополнительныеОтчетыИОбработки.ВыполнитьКоманду";
	
	// Запуск фонового выполнения дополнительной обработки
	ДанныеЗадания = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполненияФоновогоЗадания,
							    ИмяФункцииФоновогоЗадания, ПараметрыОбработкиЗагрузки);
		
	Возврат ДанныеЗадания;
	
КонецФункции

&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)
	
    ПараметрыВыбора = Новый Массив;

	//Для Каждого ЭлементСписка Из Партнер Цикл
	//	Если СписокОрганизацийДляВыбора.НайтиПоЗначению(ЭлементСписка.Значение) = Неопределено Тогда
	//		ЗаполнитьЗначенияСвойств(СписокОрганизацийДляВыбора.Добавить(), ЭлементСписка);
	//	КонецЕсли;
	//КонецЦикла;
	
	ПараметрыФормы = Новый Структура;
//	ПараметрыФормы.Вставить("Отмеченные", Организации);
	ПараметрыФормы.Вставить("ЗначенияДляВыбора", СписокПартнеров);
	ПараметрыФормы.Вставить("ЗначенияДляВыбораЗаполнены", Истина);
	ПараметрыФормы.Вставить("ОграничиватьВыборУказаннымиЗначениями", Ложь);
	ПараметрыФормы.Вставить("БыстрыйВыбор", Ложь);
	ПараметрыФормы.Вставить("Представление", НСтр("ru = 'Партнеры'"));
	ПараметрыФормы.Вставить("ПараметрыВыбора", ПараметрыВыбора);
	ПараметрыФормы.Вставить("ОписаниеТипов", Тип("СправочникСсылка.Партнеры"));
	
	Если СписокПартнеров.Количество() = 0 Тогда
		ПараметрыФормы.БыстрыйВыбор = Истина;
		ПараметрыФормы.ЗначенияДляВыбораЗаполнены = Ложь;
	КонецЕсли;
	
	Режим = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	
	Обработчик = Новый ОписаниеОповещения("ПослеВыбораПартнеров", ЭтотОбъект);
	
	ОткрытьФорму("ОбщаяФорма.ВводЗначенийСпискомСФлажками", ПараметрыФормы, ЭтотОбъект, , , , Обработчик, Режим);

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПартнеров(РезультатВыбора, ПустойПараметр) Экспорт
	Если ТипЗнч(РезультатВыбора) <> Тип("СписокЗначений") Тогда
		Возврат;
	КонецЕсли;   
	СписокПартнеров.Очистить();
	Для Каждого ЭлементСписка Из РезультатВыбора Цикл
		Если ЭлементСписка.Пометка Тогда
			ЗаполнитьЗначенияСвойств(СписокПартнеров.Добавить(), ЭлементСписка);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПодборПартнера(Команда)
	ПараметрыВыбора = Новый Массив;

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияДляВыбора", СписокПартнеров);
	ПараметрыФормы.Вставить("ЗначенияДляВыбораЗаполнены", Истина);
	ПараметрыФормы.Вставить("ОграничиватьВыборУказаннымиЗначениями", Ложь);
	ПараметрыФормы.Вставить("БыстрыйВыбор", Ложь);
	ПараметрыФормы.Вставить("Представление", НСтр("ru = 'Партнеры'"));
	ПараметрыФормы.Вставить("ПараметрыВыбора", ПараметрыВыбора);
	ПараметрыФормы.Вставить("ОписаниеТипов", СписокПартнеров.ТипЗначения);
	ПараметрыФормы.Вставить("НеСниматьПометки", ?(СписокПартнеров.Количество()=0, Ложь,Истина));
	//Если СписокПартнеров.Количество() = 0 Тогда
	//	ПараметрыФормы.БыстрыйВыбор = Истина;
	//	ПараметрыФормы.ЗначенияДляВыбораЗаполнены = Ложь;
	//КонецЕсли;
	
	Режим = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	
	Обработчик = Новый ОписаниеОповещения("ПослеВыбораПартнеров", ЭтотОбъект);
	
	ОткрытьФорму("ОбщаяФорма.ВводЗначенийСпискомСФлажками", ПараметрыФормы, ЭтотОбъект, , , , Обработчик, Режим);

КонецПроцедуры

&НаКлиенте
Процедура ТабОбСРПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Таб.ТекущиеДанные; 
	ПриИзмененииФлагов(ТекущаяСтрока.ОбСР, ТекущаяСтрока.СоглашениеРеализация);
КонецПроцедуры

&НаКлиенте
Процедура ТабОбСППриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Таб.ТекущиеДанные; 
	ПриИзмененииФлагов(ТекущаяСтрока.ОбСП, ТекущаяСтрока.СоглашениеПередача);
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииФлагов(ФлагИзм, ДогСогИзм)
	
	Если ЗначениеЗаполнено(ДогСогИзм) Тогда
		ФлагИзм = ФлагИзм;
	Иначе
		ФлагИзм = Не ФлагИзм; 
	КонецЕсли;	

КонецПроцедуры	


&НаКлиенте
Процедура ТабОбДППриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Таб.ТекущиеДанные; 
	ПриИзмененииФлагов(ТекущаяСтрока.ОбДП, ТекущаяСтрока.ДоговорПередача);

КонецПроцедуры


&НаКлиенте
Процедура ТабОбДРПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Таб.ТекущиеДанные; 
	ПриИзмененииФлагов(ТекущаяСтрока.ОбДР, ТекущаяСтрока.ДоговорРеализация);
КонецПроцедуры


&НаКлиенте
Процедура ТабОбПриИзменении(Элемент)
	ПересчитатьКолвоКонтрагентов();
КонецПроцедуры


&НаСервере
Процедура ЗаменитьНеВФонеНаСервере()
	// см. ДополнительныеОтчетыИОбработки.ВыполнитьКоманду.ПараметрыКоманды
	ПараметрыОбработкиЗагрузки = Новый Структура;
	ПараметрыОбработкиЗагрузки.Вставить("ДополнительнаяОбработкаСсылка", Параметры.ДополнительнаяОбработкаСсылка);
	ПараметрыОбработкиЗагрузки.Вставить("ИдентификаторКоманды", "");
	ПараметрыОбработкиЗагрузки.Вставить("Таблица", Объект.Таб.Выгрузить());
	ПараметрыОбработкиЗагрузки.Вставить("КоличествоОбщее", Объект.КоличествоКонтрагентов);
	ПараметрыОбработкиЗагрузки.Вставить("ВсеЗаписиСписком", Объект.ВсеЗаписиСписком.Выгрузить());
	ПараметрыОбработкиЗагрузки.Вставить("Агент", Объект.Агент);
	ПараметрыОбработкиЗагрузки.Вставить("ПоАгенту", Объект.ПоАгенту);
	
	ОбъектОбработка = РеквизитФормыВЗначение("Объект");
	ОбъектОбработка.ВыполнитьКоманду(Неопределено, ПараметрыОбработкиЗагрузки);
КонецПроцедуры


&НаКлиенте
Процедура ЗаменитьНеВФоне(Команда)
	ЗаменитьНеВФонеНаСервере();
КонецПроцедуры

