#Область РегистрацияВнешнейОбработки

Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
	
	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление = "Замена отвественного менеджера в договорах и соглашениях";
	Команда.Идентификатор = "ЗаменаОтветственногоВоВсехДоговорахИСоглашениях_3";
	Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
    Команда.ПоказыватьОповещение = Ложь;
	
	Команда                      = ПараметрыРегистрации.Команды.Добавить();
    Команда.Представление        = НСтр("ru = 'Серверный метод длительной операции'");
    Команда.Идентификатор        = ИдентификаторСерверногоМетодаОбработки();
    Команда.Использование        = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
    Команда.ПоказыватьОповещение = Ложь; 
    Команда.Скрыть               = Истина;	
	
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	ПараметрыРегистрации.Наименование = "Замена отвественного менеджера в договорах и соглашениях"; 
	ПараметрыРегистрации.Версия = "28.12.2025";
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	ПараметрыРегистрации.Информация = "Обработка используется для замены менеджеров."; 
	ПараметрыРегистрации.ВерсияБСП = "3.1.7.247";
		
	Возврат ПараметрыРегистрации;
  
КонецФункции

#КонецОбласти   

#Область СлужебныеПроцедурыИФункции
 
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыВыполнения) Экспорт
	
	ВыполнитьЗамену(ПараметрыВыполнения);
		
КонецПроцедуры

Функция ИдентификаторСерверногоМетодаОбработки() Экспорт

	Возврат Метаданные().Имя;
	
КонецФункции 

Процедура ВыполнитьЗамену(ПараметрыВыполнения)
	
	ОбновленоДоговоров = 0;   
	ОбновленоСоглашений = 0; 
	ВсегоДоговоров = 0;
	ВсегоСоглашений = 0;
	ОшибкиПоДоговору = 0;
	ОшибкиПоСоглашению = 0; 
	ВсегоОбработано = 0;
	ТекстОшибок = "";    
	
	ТекстШаблона = "Результаты выполнения замены менеджера:
					|Обработано элементов: %1
					|  • Договоров - %2
					|	 - успешно заменено: %3 
					|	 - с ошибками: %4
					|  • Соглашений - %5  
					|	 - успешно заменено: %6 
					|	 - с ошибками: %7
					|	
					|Ошибки:";
   	ТекущаяСтрока = 1;
	ПроцентВыполнения  = 0;  
	ВсеЗаписиСписком.Загрузить(ПараметрыВыполнения.ВсеЗаписиСписком);
	Таб.Загрузить(ПараметрыВыполнения.Таблица);
	Агент = ПараметрыВыполнения.Агент;
	ПоАгенту = ПараметрыВыполнения.ПоАгенту;
	Таб.Загрузить(ПараметрыВыполнения.Таблица);
	Для Каждого Стр Из Таб Цикл
		Если Стр.Об = Истина Тогда
			КоличествоДокументовДляЗагрузки = КоличествоКонтрагентов;
			ПроцентВыполнения  = Цел(ТекущаяСтрока / ПараметрыВыполнения.КоличествоОбщее * 100);   
			// Передаем информацию о прогрессе выполнения
			ДлительныеОперации.СообщитьПрогресс(ПроцентВыполнения, "");
			Если Стр.ОбДП Тогда
				ДоговорП = Стр.ДоговорПередача; 
				ИзменитьДоговор(ДоговорП, ОбновленоДоговоров, ОшибкиПоДоговору, ТекстОшибок, ПредопределенноеЗначение("Перечисление.ТипыДоговоров.СХранителем"));
			КонецЕсли;
			
			Если Стр.ОбДР Тогда
				ДоговорР = Стр.ДоговорРеализация;
				ИзменитьДоговор(ДоговорР, ОбновленоДоговоров, ОшибкиПоДоговору, ТекстОшибок, ПредопределенноеЗначение("Перечисление.ТипыДоговоров.СПокупателем"));
			КонецЕсли;
			
			Если Стр.ОбСП Тогда
				СоглашениеП = Стр.СоглашениеПередача; 
				ИзменитьСоглашение(СоглашениеП, ОбновленоСоглашений, ОшибкиПоСоглашению, ТекстОшибок, ,ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаНаХранениеСПравомПродажи"));
			КонецЕсли;
			
			Если Стр.ОбСР Тогда
				СоглашениеР = Стр.СоглашениеРеализация;
				ИзменитьСоглашение(СоглашениеР, ОбновленоСоглашений, ОшибкиПоСоглашению, ТекстОшибок, Истина, ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.РеализацияКлиенту"));
			КонецЕсли;
   			ТекущаяСтрока = ТекущаяСтрока + 1;
		КонецЕсли;
		
	КонецЦикла;      
	
	ВсегоДоговоров = ОбновленоДоговоров + ОшибкиПоДоговору;
	ВсегоСоглашений = ОбновленоСоглашений + ОшибкиПоСоглашению;  
	ВсегоОбработано = ВсегоДоговоров + ВсегоСоглашений;
	
	Текст = СтрШаблон(ТекстШаблона, ВсегоОбработано, ВсегоДоговоров, ОбновленоДоговоров, ОшибкиПоДоговору, ВсегоСоглашений, ОбновленоСоглашений, ОшибкиПоСоглашению);
	
	Если ТекстОшибок <> "" Тогда
		ДлительныеОперации.СообщитьПрогресс(ПроцентВыполнения, Текст + Символы.ПС + ТекстОшибок); 
	Иначе
		ДлительныеОперации.СообщитьПрогресс(ПроцентВыполнения, Текст);
	КонецЕсли;

КонецПроцедуры    


Процедура ИзменитьДоговор(Договор, ОбновленоДоговоров, ОшибкиПоДоговору, ТекстОшибок, Вид);
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Вид", Вид);
	ПараметрыОтбора.Вставить("Контрагент", Договор.Партнер);
	НайденныеСтроки = ВсеЗаписиСписком.НайтиСтроки(ПараметрыОтбора); 
	
	Для I =0 По НайденныеСтроки.Количество()-1 Цикл  
		
		ДоговорОбъект = НайденныеСтроки[I].Договор.ПолучитьОбъект();
		
		ДоговорОбъект.Менеджер = ПоАгенту;
		ДоговорОбъект.Наименование = "д "+ ПоАгенту; 
		ДоговорОбъект.НаименованиеДляПечати = "д "+ ПоАгенту;  
		
		Попытка
			ДоговорОбъект.Записать();  
			ОбновленоДоговоров = ОбновленоДоговоров +1;
		Исключение 
			ОшибкиПоДоговору = ОшибкиПоДоговору +1;
			ТекстОшибок = ТекстОшибок + "• "+ ДоговорОбъект.Ссылка + " - " + ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке())+Символы.ПС;
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Процедура ИзменитьСоглашение(Соглашение, ОбновленоСоглашений, ОшибкиПоСоглашению, ТекстОшибок,ИзменятьНаименование = Ложь, Вид);
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Вид", Вид);
	ПараметрыОтбора.Вставить("Контрагент", Соглашение.Партнер);
	НайденныеСтроки = ВсеЗаписиСписком.НайтиСтроки(ПараметрыОтбора); 
	
	Для I =0 По НайденныеСтроки.Количество()-1 Цикл  
		
		СоглашениеОбъект = НайденныеСтроки[I].Договор.ПолучитьОбъект();
		
		СоглашениеОбъект.Менеджер = ПоАгенту;
		
		Если  ИзменятьНаименование Тогда
			СоглашениеОбъект.Наименование = "с " + ПоАгенту; 
			//СоглашениеОбъект.НаименованиеДляПечати = "с "+Объект.ПоАгенту;  
		КонецЕсли;
		
		Попытка
			СоглашениеОбъект.Записать();  
			ОбновленоСоглашений = ОбновленоСоглашений +1;
		Исключение 
			ОшибкиПоСоглашению = ОшибкиПоСоглашению +1; 
			ТекстОшибок = ТекстОшибок + "• "+ СоглашениеОбъект.Ссылка + " - " + ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке())+Символы.ПС;
		КонецПопытки;     
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	УсловияОбслуживанияПартнеровТорговымиПредставителями.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.УсловияОбслуживанияПартнеровТорговымиПредставителями КАК УсловияОбслуживанияПартнеровТорговымиПредставителями
			|ГДЕ
			|	НЕ УсловияОбслуживанияПартнеровТорговымиПредставителями.ПометкаУдаления
			|	И УсловияОбслуживанияПартнеровТорговымиПредставителями.Владелец = &Партнер
			|	И УсловияОбслуживанияПартнеровТорговымиПредставителями.ТорговыйПредставитель = &СтарыйМенеджер";
		
		Запрос.УстановитьПараметр("Партнер", НайденныеСтроки[I].Контрагент);
		Запрос.УстановитьПараметр("СтарыйМенеджер", Агент);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Попытка
				Условие = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект(); 
				Условие.ТорговыйПредставитель = ПоАгенту; 
				Условие.Записать();
			Исключение 
				ОшибкиПоСоглашению = ОшибкиПоСоглашению +1; 
				ТекстОшибок = ТекстОшибок + "• "+"Ошибка записи условия обслуживания "+ ВыборкаДетальныеЗаписи.Ссылка + ". Причина - " + ОписаниеОшибки() + Символы.ПС;
			КонецПопытки;   
		КонецЦикла;

	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти   